[
    {
        "Title": "Dungeon Crawler",
        "Description": "Game where each room is randomly generated and the player must navigate through the levels gathering loot and killing enemies",
        "Tags": [
            "Backend",
            "Frontend",
            "Game"
        ],
        "ProjectID": "1k44f245"
    },
    {
        "Title": "Task Manager Application",
        "Description": "Application that manages your tasks or stuff to do",
        "Tags": [
            "Backend",
            "Frontend",
            "Data"
        ],
        "ProjectID": "77g6a45f"
    },
    {
        "Title": "Stock Bot",
        "Description": "In this project, you will be creating a bot or ai that tracks and predicts a certain stock. the bot will then gather and predict data given to it and make assumptions on whether to buy or sell a specific stock. it will read specific trends in data and attempt to analyze it to make the best choices for you.",
        "Tags": [
            "Api",
            "Ai",
            "Finance",
            "Stocks",
            "Analysis",
            "Automation",
            "Recommendation",
            "Prediction",
            "Data",
            "Tracker",
            "Backend"
        ],
        "ProjectID": null
    },
    {
        "Title": "Lego Piece Finder App",
        "Description": "Tired of building legos and searching endlessly through a mountain of pieces to find the one specific piece you need? with this app, it will allow you to get your camera, point it at at flat pile of lego pieces, and scan it for the specific piece you need! ",
        "Tags": [
            "App",
            "Frontend",
            "Backend",
            "Organization",
            "Automation",
            "Live",
            "Analysis",
            "Data",
            "Camera",
            "Machine Learning",
            ""
        ],
        "ProjectID": null
    },
    {
        "Title": "Password Generator",
        "Description": "Just a simple password generator that takes a libary of characters and numbers and puts them in a random sequence and stores them in a file for you. ",
        "Tags": [
            "Data",
            "Backend",
            "Organization",
            "Security",
            "Cloud",
            "RNG"
        ],
        "ProjectID": null
    },
    {
        "Title": "Chatbot",
        "Description": "Create a chatbot for customer support or just to talk to.",
        "Tags": [
            "Ai",
            "Api",
            "Backend",
            "Data",
            "Assistance"
        ],
        "ProjectID": null
    },
    {
        "Title": "Automated Recipe Bot",
        "Description": "Use a bot to search up recipes on the web until you find a recipe that you like. alternatively, you could also list the ingredients in your household and the bot will scrape the internet for recipes that have your ingredients.  ",
        "Tags": [
            "Website",
            "Scraper",
            "Data",
            "Random",
            "Ai",
            "Recommendation",
            "Web",
            "Search Engine",
            "Api",
            "Analysis"
        ],
        "ProjectID": null
    },
    {
        "Title": "Social Meida Bot",
        "Description": "Create a bot that tweets or posts something everyday. it could be an inspirational quote or life advice that was scraped from the web once a day. alternatively you could build a social media bot that reacts to certain things. for instance you might want to respond to every comment on your post. why not make a bot for that? ",
        "Tags": [
            "Ai",
            "Automation",
            "Web",
            "Api",
            "Scraper"
        ],
        "ProjectID": null
    },
    {
        "Title": "Chessbot Ai",
        "Description": "Create a bot that finds the best possible move",
        "Tags": [
            "Game",
            "Ai",
            "Recommendation",
            "Machine Learning",
            "Analysis",
            "Assistance"
        ],
        "ProjectID": null
    },
    {
        "Title": "Black Hole Simulation",
        "Description": "Create a physics engine that simulates a black hole. it would be an interactive application where you can experiment how different objects interact with black holes. you can also give the black hole and the objects that interact with the black holes properties like density and size ",
        "Tags": [
            "Physics",
            "Math",
            "Data",
            "Website",
            "Live",
            "Backend",
            "Frontend"
        ],
        "ProjectID": null
    },
    {
        "Title": "Maze Bot",
        "Description": "Create an ai that finds the shortest and most efficient way through a maze. you can make a feature where you draw the maze yourself or you can feed it an image from the internet.",
        "Tags": [
            "Ai",
            "Machine Learning",
            "Backend",
            "Frontend",
            "Web"
        ],
        "ProjectID": null
    },
    {
        "Title": "Food Distribution Route \/ World Hunger Tool",
        "Description": "Create a tool that looks at major producers of grains and other base foods and try to optimally route supplies to the nearest place where hunger is a prevelant issue.",
        "Tags": [
            "Api",
            "Map",
            "Recommendation",
            "Machine Learning",
            "Analysis",
            "Assistance",
            "Website",
            "Backend",
            "Frontend"
        ],
        "ProjectID": null
    }
]